{"_id":{"$oid":"5b4d9d280a5b34117e102598"},"statement":"Rest Api Using NodeJS and Oracle database and Swagger(Optional) : GET, POST, PUT, DELETE","category":"nodejs","description":"An application can be developed using NodeJS and Oracle database to expose rest API with different authentication method(Basic, OAuth). All sample methods can be created in a structured way and the same app can be used for projects where API needs to be created with NodeJS and Oracle DB. Even the swagger can be used in same application for documentation and API mocking. ","publisherId":"5b4874bc74c36974d9e84af9","createdOn":{"$date":{"$numberLong":"1531813160817"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5b4d9f440a5b34117e102599"},"statement":"Chat Application using NodeJS and Websocket ","category":"nodejs","description":"Many mobile apps under design initiative has chat functionality, now it has been developed in JAVA. We can make use of NodeJS to expose a websocket for chat where chat history will be stored in the database. To make it more effective, we can even include attachments as well along with text messages. ","publisherId":"5b4874bc74c36974d9e84af9","createdOn":{"$date":{"$numberLong":"1531813700625"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5b4eb2a470d2974b29af66e4"},"statement":"Uploading and Reading/Writing a CSV File in Node JS","category":"nodejs","description":"Create an application with Basic Authentication. Then upload a CSV file and then read from the CSV file and store in the DB. Perform CURD operation. Also an option to write the updated data in a CSV file.","publisherId":"5b4c6b5802ebbd0e1c18646d","createdOn":{"$date":{"$numberLong":"1531884196496"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5b4f107270d2974b29af66ea"},"statement":"Use Nodejs to create event with Block chain. Thats gonna help us in future project","category":"nodejs","description":"Hyperledger fabric block chain  come up with Nodejs SDK. If we use this SDK then we can catch event happening in chaincode. \n","publisherId":"5b4759f674c36974d9e84adf","createdOn":{"$date":{"$numberLong":"1531908210818"}},"__v":{"$numberInt":"1"}}
{"_id":{"$oid":"5b505c8cf53e9076f99b500e"},"statement":"Nodejs container for the Oracle Jet","category":"nodejs","description":"Creating one nodejs container for Oracle Jet which can be deployed in Application Container Cloud Service","publisherId":"5b4828df74c36974d9e84aec","createdOn":{"$date":{"$numberLong":"1531993228718"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5b5061f7f53e9076f99b5011"},"statement":"Property Management extension for Sales Cloud","category":"js","description":"Oracle Property Management is not available in cloud. It is very difficult for Sales Cloud people to show the Properties in sales cloud to show to the customer.\nSo need to create one hybrid application where the data will be from the Property Management and will be integrated with the Sales Cloud where in the ui the Sales people can show the properties and book the properties.","publisherId":"5b4828df74c36974d9e84aec","createdOn":{"$date":{"$numberLong":"1531994615727"}},"__v":{"$numberInt":"0"}}
